# ExternalApplicationArrayIterator Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArrayIterator Constructor
ExternalApplicationArrayIterator Class See Also
---
For Internal Use Only.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExternalApplicationArrayIterator()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExternalApplicationArrayIterator()
```

# Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
# See Also
ExternalApplicationArrayIterator Class
Autodesk.Revit.UI Namespace